gauya/bluepill_cube/lib/stm32/src/gadc.cpp
#include "gadc.h"
#include <glog.h>

#ifdef __cplusplus
extern "C" {
#endif

DMA_HandleTypeDef hdma_adc1;
ADC_HandleTypeDef hadc1;

extern uint16_t *adc_buffer;
void (*_stm32adc_callback)() = 0;

int adc_completed = 0;
int dma_finish1 = 0;
int dma_finish2 = 0;

int adc_mode=0;
int adc_count=0;

int HUL_ADC_clk_enable(ADC_TypeDef *adc);
int HUL_GPIO_clk_enable(GPIO_TypeDef *gpio);
int HUL_ADC_nvic(ADC_TypeDef *adc, int enable);

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
  if( _stm32adc_callback ) {
    _stm32adc_callback();
  }
  adc_completed++;
  if( adc_mode == 1) {

  } else {

  }
}

void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc) {
  //dma_finish1++;
}

void HAL_DMA_TransferCpltCallback(DMA_HandleTypeDef *hdma) {
  //dma_finish2++;
}

#if 1 // F1
void ADC1_2_IRQHandler(void) {
  HAL_ADC_IRQHandler(&hadc1); 
}

void DMA1_Channel1_IRQHandler(void) {
  HAL_DMA_IRQHandler(&hdma_adc1);
  dma_finish2++;
}
#else
void ADC_IRQHandler(void) {
  HAL_ADC_IRQHandler(&hadc1);
}
void DMA2_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&hdma_adc1);
}
#endif

int HUL_ADC_clk_enable(ADC_TypeDef *adc) {
#if defined(ADC1)
  if (adc == ADC1) {
    __HAL_RCC_ADC1_CLK_ENABLE();
    return 1;
  } 
#endif
#if defined(ADC2)
  if (adc == ADC2) {
    __HAL_RCC_ADC2_CLK_ENABLE();
    return 1;
  } 
#endif
#if defined(ADC3)
  if (adc == ADC3) {
    __HAL_RCC_ADC3_CLK_ENABLE();
    return 1;
  } 
#endif
  return 0;
}

int HUL_GPIO_clk_enable(GPIO_TypeDef *gpio) {
//__HAL_RCC_GPIOA_CLK_ENABLE
  if( ! IS_GPIO_ALL_INSTANCE(gpio) ) 
    return 0;
#if defined(GPIOA)
  if( gpio == GPIOA ) {
    __HAL_RCC_GPIOA_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOB)
  if( gpio == GPIOB ) {
    __HAL_RCC_GPIOB_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOC)
  if( gpio == GPIOC ) {
    __HAL_RCC_GPIOC_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOD)
  if( gpio == GPIOD ) {
    __HAL_RCC_GPIOD_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOE)
  if( gpio == GPIOE ) {
    __HAL_RCC_GPIOE_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOF)
  if( gpio == GPIOFF ) {
    __HAL_RCC_GPIOF_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOG)
  if( gpio == GPIOG ) {
    __HAL_RCC_GPIOG_CLK_ENABLE();
    return 1;
  }
#endif
#if defined(GPIOH)
  if( gpio == GPIOH ) {
    __HAL_RCC_GPIOH_CLK_ENABLE();
    return 1;
  }
#endif
  return 0;
}


int HUL_ADC_nvic(ADC_TypeDef *adc, int enable) {
#if 1 // F1  
  if( ADC1 == adc ) {
    if( enable ) {
      HAL_NVIC_SetPriority(ADC1_2_IRQn, 0, 0); // M4 ADC_IRQn
      HAL_NVIC_EnableIRQ(ADC1_2_IRQn);
      return 1;
    } else {
      HAL_NVIC_DisableIRQ(ADC1_2_IRQn);
      return 0;
    }
  } else return -1;
#else 
  if( ADC1 == adc ) {
    if( enable ) {
      HAL_NVIC_SetPriority(ADC1_IRQn, 0, 0); // M4 ADC_IRQn
      HAL_NVIC_EnableIRQ(ADC1_IRQn);
      return 1;
    } else {
      HAL_NVIC_DisableIRQ(ADC1_IRQn);
      return 0;
    }
  }  else return -1;
}
#endif
}

int HUL_DMA_nvic(ADC_TypeDef *adc, int enable) {
#if 1 // F1  
  if( ADC1 == adc ) {
    if( enable ) {
      __HAL_RCC_DMA1_CLK_ENABLE();

      HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
      HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);      

      return 1;
    } else {
      HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);   
      return 0;
    }

  } else return -1;
#else // F4
  if( ADC1 == adc ) {
    if( enable ) {
      __HAL_RCC_DMA2_CLK_ENABLE();
      HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, 0, 0);
      HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
  
      return 1;
    } else {

      return 0;
    }
  }  else return -1;
#endif
}


// multichannel, use dma, scan mode, not continuous, one adc

class gadc {
private:
protected:
  ADC_HandleTypeDef *_ha; // ->Instance (ADC_TypeDef *adc);
  DMA_HandleTypeDef *_hd; //

  ADC_ChannelConfTypeDef _ac;
  struct adc_channels *_chs;  
  uint16_t _mode;
  int _status; 
  uint16_t _timeout;

  uint16_t *_dmabuf;
  
  int add_channel(adc_channels *ac); // return channels;
  int add_channel(uint32_t ch, uint32_t samplerate=ADC_SAMPLETIME_41CYCLES_5); // Vref, temp, ADC_SAMPLETIME_2CYCLE_5
public:
  int _channel_num;

public:
  gadc();
  gadc(ADC_TypeDef *adc, struct adc_channels *ac);
  //gadc(ADC_TypeDef *adc, int ch, GPIO_TypeDef *port, int pin);
  virtual ~gadc(){};
  
  void setup(ADC_TypeDef *adc, struct adc_channels *ac);
  void setup();
  //static void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *);

  bool isready() { return (_status != eADC_NOTSETUP);}
  int channel_num() { return _channel_num; };
  uint16_t& mode() { return _mode; }
  ADC_HandleTypeDef *get_handle() { return _ha; }

  int start();
  int stop();

  int read();
  int read(uint16_t *buf); // buf length = chs
};

// ---------------------------------------------------------------------------------
gadc::gadc() { //LSE_STARTUP_TIMEOUT
  _channel_num = 0;
  _timeout = 1; // ms
  _status = eADC_NOTSETUP; // -1
  _mode = eADC_POLLING; // 0       (_mode & 0x7)
}

//#include <stm32f4xx_hal.h>

gadc::gadc(ADC_TypeDef *adc, struct adc_channels *ac) {
  if(adc == ADC1) {
    _ha = &hadc1;
  } else {
  //if(adc == ADC2) {
    return;
    //_ha = &hadc2;
  }
  _channel_num = 0;
  _timeout = 100; // ms
  _status = eADC_NOTSETUP; // -1
  _mode = eADC_POLLING; // 0       (_mode & 0x7)

//  setup(adc, ac);
}

void gadc::setup(ADC_TypeDef *adc, struct adc_channels *ac) {
  _status = -1;
  if(adc == ADC1) {
    _ha = &hadc1;
  } else {
  //if(adc == ADC2) {
    return;
    //_ha = &hadc2;
  }
  HUL_ADC_clk_enable(_ha->Instance);

  _ha->Instance = adc;
  _channel_num = 0;
  _timeout = 1; // ms
  _status = 0;
 
  int chs = 0;
  for(; (ac+chs)->ch != -1 ; chs++);
  
  _ha->Init.ExternalTrigConv = ADC_SOFTWARE_START;
  _ha->Init.DataAlign = ADC_DATAALIGN_RIGHT;
  _ha->Init.NbrOfConversion = chs;                   // <> _channel_num
  _ha->Init.DiscontinuousConvMode = DISABLE;
  _ha->Init.ScanConvMode = ENABLE;
  _ha->Init.ContinuousConvMode = DISABLE; //ENABLE;

  HUL_ADC_clk_enable(adc);

