gauya/bluepill_cube/lib/stm32/src/gadc.cpp
// multi, continues, use dma
#if defined(STM32F4) || defined(STM32F7)
  _ha->Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  _ha->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2;
  _ha->Init.Resolution = ADC_RESOLUTION_12B;
  _ha->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  if( _mode == eADC_DMA || _mode == eADC_DMAINTERRUPT ) {
    _ha->Init.DMAContinuousRequests = ENABLE;
  } else {
    _ha->Init.DMAContinuousRequests = DISABLE;
  }
#endif //STM32F4

  if (HAL_ADC_Init(_ha) != HAL_OK) // --> call HAL_ADC_MspInit()
  {
    ERROR_LOG(""); //Error_Handler();
  }

  _chs = ac;

  for(int i=0; i < _ha->Init.NbrOfConversion; i++) {
    add_channel(ac+i);
  }

  //HAL_ADC_TempSensor_Enable();
  //HAL_ADC_TempSensorVrefintCmd(ENABLE);
  //while(HAL_ADCEx_Calibration_Start(&_ha) != HAL_OK);
  //HAL_ADC_SelfCalibration_Start();
  //HAL_ADC_Calibration_Start();
  
  /* Set ADC number of conversion */
  //hadc->Instance->SQR1 &= ~(ADC_SQR1_L);
  //hadc->Instance->SQR1 |=  ADC_SQR1(hadc->Init.NbrOfConversion);

  _status = 0;
}

int stm32adc::add_channel(uint32_t ch,uint32_t samplerate) {
  ADC_ChannelConfTypeDef sConfig = {0};
  sConfig.Channel = ch;
  sConfig.SamplingTime = samplerate; // default ADC_SAMPLETIME_84CYCLES; 
  sConfig.Rank = ++_channel_num; // 1 ~ ,  

  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_LOG("add adc channel"); //Error_Handler();
  }

  return  _channel_num; // rank is auto increase sequentially
}

int stm32adc::add_channel(struct adc_channels *ac) {
  ADC_ChannelConfTypeDef sConfig = {0};
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  
  sConfig.Channel = ac->ch;
  sConfig.Rank = ac->rank = _channel_num; // 0~ order by
  sConfig.SamplingTime = ac->sampling; //ADC_SAMPLETIME_3CYCLES;
  
  if (HAL_ADC_ConfigChannel(_ha, &sConfig) != HAL_OK) {
    ERROR_LOG("add adc channel"); //Error_Handler();
  }

  if( ac->port != 0 ) { // not Vrefint, temperture, ..
    // ---> HUL_GPIO_CLK_Enable(ac->port)
    if( IS_GPIO_ALL_INSTANCE(ac->port)) {
      if( IS_GPIO_ALL_INSTANCE(GPIOA) && (ac->port == GPIOA) ) { __HAL_RCC_GPIOA_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOB) && (ac->port == GPIOB )) { __HAL_RCC_GPIOB_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOC) && (ac->port == GPIOC )) { __HAL_RCC_GPIOC_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOD) && (ac->port == GPIOD )) { __HAL_RCC_GPIOD_CLK_ENABLE(); }
      else if( IS_GPIO_ALL_INSTANCE(GPIOE) && (ac->port == GPIOE )) { __HAL_RCC_GPIOE_CLK_ENABLE(); }
//      else if( IS_GPIO_ALL_INSTANCE(GPIOH) && (ac->port == GPIOH )) { __HAL_RCC_GPIOH_CLK_ENABLE(); }
    } else {
      _status |= 4;
      return -1;
    }

    GPIO_InitStruct.Pin = (1 << (ac->pin)); //GPIO_PIN_n;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL; //GPIO_PULLDOWN; //GPIO_NOPULL;
    HAL_GPIO_Init(ac->port, &GPIO_InitStruct);
  }

  return ++_channel_num;
}

void stm32adc::start() {
  if( ! isready() ) return;

  if(HAL_ADC_Start(_ha) != HAL_OK) {
    ERROR_LOG(""); //Error_Handler();
  }
}

void stm32adc::stop() {
  if( ! isready() ) return;

  HAL_ADC_Stop(_ha);
}

void stm32adc::conv() {
  if( isready() ) {
    if(HAL_ADC_PollForConversion(_ha, this->_timeout) != HAL_OK) {
      ERROR_LOG(""); //Error_Handler();
    }
  }
}

int stm32adc::read() {
  if( ! isready() ) { 
    return (-1);
  }
  if( _mode == eADC_POLLING ) {
    start();
    
    if(HAL_ADC_PollForConversion(_ha, this->_timeout) != HAL_OK) {
    ERROR_LOG(""); //Error_Handler();
    }
  }

  uint32_t val = HAL_ADC_GetValue(_ha);  // get adc value

  if( _mode == eADC_POLLING ) {
    stop();
  }
  
  return (int)(val & (uint32_t)0xfffl);
}

int stm32adc::read(uint16_t *buf) {
  start();

  int i = 0;
  for(; i < _channel_num; i++ ) {
    if(HAL_ADC_PollForConversion(_ha, 1) != HAL_OK) {
    ERROR_LOG(""); //Error_Handler();
    }
    
    uint32_t v = HAL_ADC_GetValue(_ha);  // get adc value
    buf[i] = (uint16_t)(v & 0x0fffU);
  }

  stop();

  return i;
}

/// @brief ////////////////////////////////////////////////////////////////////////////////////////////////////

stm32adcint::stm32adcint() 
: stm32adc() {
  _mode = eADC_INTERRUPT;
  HUL_ADC_nvic(get_handle()->Instance, 1);
}

stm32adcint::stm32adcint(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)()) 
: stm32adc(adc, ac) {
  _mode = eADC_INTERRUPT;
  HUL_ADC_nvic(get_handle()->Instance, 1);
}

stm32adcint::~stm32adcint() {
  stop();
  
  HUL_ADC_nvic(get_handle()->Instance, 0);
  
  detach();
}

void stm32adcint::setup(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)()) {
  stm32adc::setup(adc, ac);
  attach(intrf);
}

void stm32adcint::start() {
  if( HAL_ADC_Start_IT(this->_ha) != HAL_OK ) {
    ERROR_LOG(""); //Error_Handler();
  }
}

void stm32adcint::stop() {
  if( ! isready() ) return;

  HAL_ADC_Stop_IT(get_handle());
}

void stm32adcint::attach( void (*inf)()) {
  _stm32adc_callback = inf;
}

void stm32adcint::detach() {
  _stm32adc_callback = (void(*)())0;
}

int stm32adcint::read() {
  if( ! isready() ) return -1;

  int val = stm32adc::read();
  return val;
}

// -------------------------------------------------------------------------------------------------

stm32adcdma::stm32adcdma() 
: stm32adc() {
  _dmabuf = 0;
  _mode = eADC_DMAINTERRUPT;
}

stm32adcdma::stm32adcdma(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)(), uint16_t *dmabuf) 
: stm32adc(adc, ac) {
  _mode = eADC_DMAINTERRUPT;
  _dmabuf = dmabuf;
}

void stm32adcdma::setup(ADC_TypeDef *adc, struct adc_channels *ac, void (*intrf)(), uint16_t *dmabuf) {
  if( !dmabuf ) {
    _dmabuf = new uint16_t[channel_num()*2];
    _outbuf = new uint16_t[channel_num()*2];
  }

  HUL_ADC_nvic(get_handle()->Instance, 1);
  HUL_ADC_clk_enable(adc);
  HUL_DMA_nvic(adc,1);

#if 1  // F1

  hdma_adc1.Instance = DMA1_Channel1;
  hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;
  hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  hdma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
  hdma_adc1.Init.Mode = DMA_CIRCULAR;
  hdma_adc1.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
  {
    ERROR_LOG(""); //Error_Handler();
  }

#else  // F4

  hdma_adc1.Instance = DMA2_Stream0;
  hdma_adc1.Init.Channel = DMA_CHANNEL_0;
  hdma_adc1.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_adc1.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_adc1.Init.MemInc = DMA_MINC_ENABLE;
  hdma_adc1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
  hdma_adc1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
  hdma_adc1.Init.Mode = DMA_CIRCULAR;
  hdma_adc1.Init.Priority = DMA_PRIORITY_MEDIUM; //DMA_PRIORITY_LOW;
  hdma_adc1.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  if (HAL_DMA_Init(&hdma_adc1) != HAL_OK)
  {
    ERROR_LOG(""); //Error_Handler();
  }

